Autodesk.Revit.DB.Events.DataTransferMode
Describes the data transfer mode.
Describes the data transfer mode.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DataTransferMode.Upload
Transfer data from client to server.

Autodesk.Revit.DB.Events.DataTransferMode.Download
Transfer data from server to client.

Autodesk.Revit.DB.Events.DataTransferMode.Undefined
Undefined mode.